import 'package:flutter/material.dart';

class Help extends StatefulWidget {
  const Help({super.key});

  @override
  State<Help> createState() => _AboutUsPageState();
}

class _AboutUsPageState extends State<Help> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(
          'TIktokSHoping',
          style: TextStyle(fontWeight: FontWeight.bold),
        ),
        centerTitle: true,
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            SizedBox(height: 10),
            Text(
              'ขั้นตอนการดำเนินงานของห้างสรรพสินค้า',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'กระบวนการเฉพาะมีดังนี้:',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(1) ลงทะเบียนบัญชีสมาชิกโดยใช้หมายเลขโทรศัพท์มือถือหรือที่อยู่อีเมลของคุณ',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(2) คลิก ฉันต้องการเปิดร้านค้า--กรอกข้อมูลการสมัครส่วนบุคคลหรือข้อมูลการสมัครบริษัท--เปิดร้านค้า--กำลังรอการตรวจสอบระบบ',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(3) หลังจากเปิดร้านได้สำเร็จ: ศูนย์จัดซื้อ เลือกผลิตภัณฑ์ที่คุณต้องการขาย และ การขายผลิตภัณฑ์ จะลบผลิตภัณฑ์ที่คุณไม่ต้องการขาย',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(4) รอการจัดส่ง: ดูหรือชำระค่าสินค้าที่ลูกค้าซื้อในร้านค้าของคุณ',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              '(5) รอรับสินค้า: ตรวจสอบว่าลูกค้าได้รับสินค้าแล้วหรือไม่',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(6) ยอดคงเหลือของผู้ขาย: หลังจากที่ลูกค้าได้รับสินค้าแล้ว เงินต้นและค่าคอมมิชชั่นจะถูกคืนให้กับคุณ',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(7) กำไรรวม: กำไรรวมของร้านค้าของคุณตั้งแต่วันที่เปิดร้าน',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(8) การโอนยอดคงเหลือ: โอนยอดการค้าของคุณไปยังบัญชีสมาชิกของคุณ ซึ่งสามารถนำไปใช้ชำระค่าคำสั่งซื้อของลูกค้าหรือสมัครถอนเงินได้',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              '(9) วิธีการเติมเงิน: รองรับการชำระเงิน USDT และการโอนเงินผ่านบัตรธนาคาร โปรดติดต่อฝ่ายบริการลูกค้าออนไลน์',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(10) การถอนเงิน: ผูกบัตรธนาคารหรือที่อยู่รับ USDT',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '1. ห้างสรรพสินค้าของเราร่วมมือกับผู้ผลิตทั่วโลก และลูกค้าของเรามาจากทั่วทุกมุมโลก พูดง่ายๆ ก็คือ คุณเปิดร้านในห้างสรรพสินค้าของเราเพื่อช่วยผู้ผลิตขายสินค้า และผู้ผลิตสามารถคืนค่าคอมมิชชั่นให้กับคุณได้ คุณสามารถทำกำไรได้ ร้านค้าของคุณสามารถขายสินค้าได้มากขึ้นและระดับร้านค้าของคุณก็จะเพิ่มขึ้นตามไปด้วย และคุณยังสามารถได้รับอัตราส่วนค่าคอมมิชชั่นที่สูงขึ้นอีกด้วย',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '2. ผู้ผลิตเป็นผู้รับผิดชอบโดยตรงด้านโลจิสติกส์ และคุณไม่จำเป็นต้องรับผิดชอบค่าใช้จ่ายใดๆ เมื่อลูกค้าซื้อสินค้าจากร้านค้าของคุณ คุณเพียงแค่ต้องชำระเงินสำหรับคำสั่งซื้อและจัดส่งสินค้าไปให้ลูกค้าเท่านั้น ข้อแตกต่างระหว่างร้านค้านี้กับหน้าร้านคือคุณไม่จำเป็นต้องตุนสินค้าและไม่จำเป็นต้องใช้เงินทุนจำนวนมาก',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '3. หลังจากที่คุณเปิดร้านค้า คุณสามารถเลือกสินค้าที่คุณต้องการขายในศูนย์จัดซื้อในการจัดการร้านค้า จากนั้นเมื่อลูกค้าเยี่ยมชมร้านค้าของคุณ คุณจะต้องตอบคำถามของลูกค้าในฝ่ายบริการลูกค้าของร้านค้าหลังจากที่ลูกค้าซื้อ สำเร็จคุณต้องชำระเงิน ส่งสินค้าให้ผู้ขาย และคุณจะได้รับเงินต้นและค่าคอมมิชชั่นหลังจากที่ลูกค้าได้รับสินค้า',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            Text(
              '4. การเปิดร้านในห้างสรรพสินค้า ประการแรก ห้างสรรพสินค้ามีหน้าที่ดูแลให้มีปริมาณลูกค้าเข้าร้านเพียงพอที่จะซื้อสินค้า ทั้งนี้ เพื่อปกป้องผลกำไรของพ่อค้า ขณะเดียวกัน ห้างสรรพสินค้า ยังสัญญากับลูกค้าว่าหลังจากซื้อสินค้าแล้วร้านค้าจะต้องชำระเงินตามคำสั่งซื้อภายใน 24 ชั่วโมง จัดส่งให้กับลูกค้า หลังจากที่ลูกค้าได้รับสินค้าแล้ว คุณจะได้รับเงินต้นและผลกำไรของคุณ ทุกคนต้องรักษาสภาพแวดล้อมในการช็อปปิ้งที่ดี',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '5. คำถามที่พบบ่อย:',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(1) ลูกค้ามาจากไหน?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'คำตอบ: สวัสดี ลูกค้าของเรามาจาก TikTok เป็นหลัก',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              '(2) ปกติสินค้าจะถึงมือลูกค้าเมื่อใด?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'คำตอบ: สวัสดี ห้างสรรพสินค้าสนับสนุนร้านค้าใหม่ คำสั่งซื้อแรกของร้านค้าใหม่รับประกันว่าผู้ผลิตจะจัดส่งให้กับลูกค้าและร้านค้าสามารถรับเงินต้นและค่าคอมมิชชั่นได้ทันที โดยปกติการสั่งซื้อครั้งถัดไปจะใช้เวลาจัดส่งถึงลูกค้า 3-7 วัน ส่วนวันหยุดนักขัตฤกษ์จะจัดส่งให้ลูกค้าภายใน 7-14 วัน',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(3) การฝากและถอนเงินใช้เวลานานเท่าใดจึงจะมาถึง?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'คำตอบ: สวัสดี เนื่องจากมีร้านค้าจำนวนมาก การเติมเงินและถอนเงินจึงต้องดำเนินการตามคิว และการเงินจะดำเนินการภายใน 15 นาที',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              '(4) ทำไมร้านค้ายังต้องชำระเงินหลังจากที่ลูกค้าชำระเงินแล้ว?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'คำตอบ: สวัสดี เพื่อเป็นการป้องกันร้านค้าบางแห่งไม่ส่งสินค้าให้กับลูกค้า ทางห้างสรรพสินค้าจะเก็บเงินที่ลูกค้าจ่ายไว้และยังสะดวกสำหรับการคืนเงินให้กับลูกค้าโดยตรงในกรณีที่ลูกค้าต้องการคืนสินค้า สินค้าดังนั้นร้านค้าจะต้องจ่ายเงินให้ผู้ผลิตเพื่อส่งสินค้า เมื่อลูกค้าได้รับสินค้า ห้างสรรพสินค้าจะคืนเงินที่ลูกค้าจ่ายให้กับร้านค้า และผู้ผลิตจะคืนกำไรให้กับร้านค้า (เงินต้น) และคอมมิชชั่นจะถูกเครดิตไปพร้อมๆ กัน)',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              '(5) ฉันจำเป็นต้องตุนสินค้าเพื่อเปิดร้านในห้างสรรพสินค้าหรือไม่?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 10),
            Text(
              'คำตอบ: สวัสดี ไม่จำเป็นต้องตุนสินค้าเมื่อเปิดร้าน สินค้านั้นจัดทำโดยผู้ผลิตโดยตรง พ่อค้าจะต้องเลือกรูปถ่ายสินค้าที่ขายในศูนย์จัดซื้อเท่านั้น',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              '(6) ฉันสามารถสมัครปิดร้านได้หรือไม่?',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
            SizedBox(height: 20),
            Text(
              'คำตอบ : สวัสดี ก่อนสมัครปิดร้าน พ่อค้าจะต้องชำระเงินทุกออเดอร์และส่งสินค้าให้กับลูกค้าก่อน',
              style: TextStyle(fontSize: 16, height: 1.5),
            ),
          ],
        ),
      ),
    );
  }
}
